using System;

namespace инд_2
{
    class Program
    {
        static void Main(string[] args)
        {
// Написать программу, выводящую на экран количество случаев в массиве, когда знак элемента
// отличается от предыдущего.✔
// Примечание. Для всех вариантов программа сначала должна запрашивать у пользователя N –
// некоторое четное (!) число элементов массива, а затем и сами элементы массива.✔
            Console.WriteLine("______________________________________________________________________________________");
            Console.WriteLine("                                    Заполните Массив                                  ");
            Console.WriteLine("______________________________________________________________________________________");
            int [] mas = new int[131]; // 131 любимое число, могу себе позволить 
            Console.WriteLine("______________________________________________________________________________________");
            Console.WriteLine($"                                 Введите размер массива:                             ");
            Console.WriteLine($"                  Примечание.Размерность массива должна быть четной!                 ");
            Console.WriteLine("______________________________________________________________________________________");
            int razm = int.Parse(Console.ReadLine());
            if(razm<=0)
            {
                Console.WriteLine("______________________________________________________________________________________");
                Console.WriteLine($"                                К сожалению вы хлебушек :(                           ");
                Console.WriteLine("______________________________________________________________________________________");
                while (razm<=0)
                {
                    Console.WriteLine("______________________________________________________________________________________");
                    Console.WriteLine($"                 Размерность массива не может быть меньше или равна нулю!            ");
                    Console.WriteLine($"                  Примечание.Размерность массива должна быть четной!                 ");
                    Console.WriteLine($"                                 Введите размер массива:                             ");
                    Console.WriteLine("______________________________________________________________________________________");
                    razm = int.Parse(Console.ReadLine()); 
                }
            }
            if(razm % 2==1)
            {
                while (razm % 2==1)
                {
                    Console.WriteLine("______________________________________________________________________________________");
                    Console.WriteLine($"                  Примечание.Размерность массива должна быть четной!                 ");
                    Console.WriteLine($"                                 Введите размер массива:                             ");
                    Console.WriteLine("______________________________________________________________________________________");
                    razm = int.Parse(Console.ReadLine()); 
                }

            }  
            for (int i = 0; i < razm; i++) // Ctrl+C \\ Ctr + V \\ из прошлого задания не карается ? надеюсь нет
            {
                Console.WriteLine("______________________________________________________________________________________");
                Console.WriteLine($"Введите {i+1}-й элемент  массива:");
                Console.WriteLine("______________________________________________________________________________________");
                int g = int.Parse(Console.ReadLine());
                Console.WriteLine("______________________________________________________________________________________");
                mas[i] = g; 
            }
            Console.WriteLine("______________________________________________________________________________________");
            Console.WriteLine("                                          Массив                                      ");
            Console.WriteLine("______________________________________________________________________________________");
            for (int i = 0; i < razm; i++) // Ctrl+C \\ Ctr + V \\ из прошлого задания не карается ? надеюсь нет
            { 
                Console.Write($"|{mas[i]}|  \t");
            }
            Console.WriteLine();
            Console.WriteLine("______________________________________________________________________________________");
            int j=0;
            int k=0;
            for (int i = 1; i < razm; i++) // Ctrl+C \\ Ctr + V \\ из прошлого задания не карается ? надеюсь нет
            {
                if(mas[i]>=0)
                {
                    j++;
                }
                else if(mas[i]<0)
                {
                    j++;
                }
                if(mas[i]==mas[i-1])
                {
                    j--;
                }
            }
            Console.WriteLine("______________________________________________________________________________________");
            Console.WriteLine($"     Количество случаев в массиве, когда знак элемента отличается от предыдущего:    ");
            Console.WriteLine($"                                        |{j}|                                       ");
            Console.WriteLine("______________________________________________________________________________________");
            
            
           
        }
    }
}
